In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [60]:
data={
      'Capital':['Beijing','New dd','Brasd'],
      'Country':['China','sd','asd'],
     'Population':['123','2323','12323']}

In [61]:
data

{'Capital': ['Beijing', 'New dd', 'Brasd'],
 'Country': ['China', 'sd', 'asd'],
 'Population': ['123', '2323', '12323']}

In [62]:
df=DataFrame(data,index=['A','B','C'])#关系是，DataFrame是一系列的Series

In [63]:
df

   Capital Country Population
A  Beijing   China        123
B   New dd      sd       2323
C    Brasd     asd      12323

In [27]:
xx=Series(['asd','sdd','aaa'],index=[1,2,3])
xx

1    asd
2    sdd
3    aaa
dtype: object

In [21]:
df[0:1]

   Capital Country Population
A  Beijing   China        123

In [11]:
df.iloc[0:2,1:2]

  Country
A   China
B      sd

In [18]:
df['Capital']

A    Beijing
B     New dd
C      Brasd
Name: Capital, dtype: object

In [12]:
df.loc['A'] #loc 就可以用来直接请求index的东西

Capital       Beijing
Country         China
Population        123
Name: A, dtype: object

In [15]:
df.loc[['A','B']]

   Capital Country Population
A  Beijing   China        123
B   New dd      sd       2323

In [25]:
df.iloc[0:1,0:2]

   Capital Country
A  Beijing   China

In [28]:
for row in df.iteritems():
    print(row)

('Capital', A    Beijing
B     New dd
C      Brasd
Name: Capital, dtype: object)
('Country', A    China
B       sd
C      asd
Name: Country, dtype: object)
('Population', A      123
B     2323
C    12323
Name: Population, dtype: object)

In [33]:
for row in df.iteritems():
    print(row[0],row[1])
    break

Capital A    Beijing
B     New dd
C      Brasd
Name: Capital, dtype: object

In [34]:
data

{'Capital': ['Beijing', 'New dd', 'Brasd'],
 'Country': ['China', 'sd', 'asd'],
 'Population': ['123', '2323', '12323']}

In [36]:
s1=Series(data['Capital'])
s2=Series(data['Country'])
s3=Series(data['Population'])

In [41]:
df_new=DataFrame([s1,s2,s3],index=['Capital','Country','Populartion'])

In [42]:
df_new#顺序是不对的，所以要用反转T

                   0       1      2
Capital      Beijing  New dd  Brasd
Country        China      sd    asd
Populartion      123    2323  12323

In [43]:
df

   Capital Country Population
A  Beijing   China        123
B   New dd      sd       2323
C    Brasd     asd      12323

In [46]:
df_new=df_new.T

In [47]:
df_new

   Capital Country Populartion
0  Beijing   China         123
1   New dd      sd        2323
2    Brasd     asd       12323

In [48]:
df_new.index

RangeIndex(start=0, stop=3, step=1)

In [49]:
df_new.index=['A','B','C']

In [50]:
df_new

   Capital Country Populartion
A  Beijing   China         123
B   New dd      sd        2323
C    Brasd     asd       12323

In [64]:
#dataFrame和Series的关系是相互的，可用一组series构成dataframe，但是顺序不对。
#'Capital':['Beijing','New dd','Brasd']
# Series是横着，dataframe是竖着，所以要T